[Killed] BlockStatement
src/services/ShippingService.ts:5:41
 
 export class ShippingService implements IShippingService {
 
-  calculateCost(weight: number): number {
-
-    if (weight <= 0) {
-      throw new Error("El peso debe ser mayor a 0");
-    }
-
-    if (weight <= 5) {
-      return 10000;
-    }
-
-    if (weight <= 20) {
-      return 20000;
-    }
-    
-    if( weight <=40){
-        return 40000;
-    }
-
-    else  return 50000;
-   
-  }
+  calculateCost(weight: number): number {}
 
 }
killedBy: ShippingService Deberia ser un error si el peso es <= 0
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/services/ShippingService.ts:7:22
 
   calculateCost(weight: number): number {
 
-    if (weight <= 0) {
-      throw new Error("El peso debe ser mayor a 0");
-    }
+    if (weight <= 0) {}
 
     if (weight <= 5) {
killedBy: ShippingService Deberia ser un error si el peso es <= 0
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/services/ShippingService.ts:7:9
 
   calculateCost(weight: number): number {
 
-    if (weight <= 0) {
+    if (false) {
       throw new Error("El peso debe ser mayor a 0");
     }
killedBy: ShippingService Deberia ser un error si el peso es <= 0
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/services/ShippingService.ts:11:9
       throw new Error("El peso debe ser mayor a 0");
     }
 
-    if (weight <= 5) {
+    if (weight > 5) {
       return 10000;
     }
killedBy: ShippingService Deberia devolver 10000 para pesos entre 0 y 5
statusReason: expected 20000 to be 10000 // Object.is equality

[Killed] BlockStatement
src/services/ShippingService.ts:11:22
       throw new Error("El peso debe ser mayor a 0");
     }
 
-    if (weight <= 5) {
-      return 10000;
-    }
+    if (weight <= 5) {}
 
     if (weight <= 20) {
killedBy: ShippingService Deberia devolver 10000 para pesos entre 0 y 5
statusReason: expected 20000 to be 10000 // Object.is equality

[Killed] BlockStatement
src/services/ShippingService.ts:15:23
       return 10000;
     }
 
-    if (weight <= 20) {
-      return 20000;
-    }
+    if (weight <= 20) {}
     
     if( weight <=40){
killedBy: ShippingService Deberia devolver 20000 para pesos entre 5 y 20
statusReason: expected 40000 to be 20000 // Object.is equality

[Killed] ConditionalExpression
src/services/ShippingService.ts:15:9
       return 10000;
     }
 
-    if (weight <= 20) {
+    if (false) {
       return 20000;
     }
killedBy: ShippingService Deberia devolver 20000 para pesos entre 5 y 20
statusReason: expected 40000 to be 20000 // Object.is equality

[Killed] EqualityOperator
src/services/ShippingService.ts:19:9
       return 20000;
     }
     
-    if( weight <=40){
+    if( weight < 40){
         return 40000;
     }
killedBy: ShippingService Deberia devolver 40000 para pesos entre 21 y 40
statusReason: expected 50000 to be 40000 // Object.is equality

[Killed] BlockStatement
src/services/ShippingService.ts:19:21
       return 20000;
     }
     
-    if( weight <=40){
-        return 40000;
-    }
+    if( weight <=40){}
 
     else  return 50000;
killedBy: ShippingService Deberia devolver 40000 para pesos entre 21 y 40
statusReason: expected undefined to be 40000 // Object.is equality
